{
    "feedback": [
      {
        "name": "Harinee",
        "department": "CSE",
        "year": "3rd year",
        "comments": "It was a good experience sir. We came to know our speed. Many questions were easy and some were a bit tricky. Time management is crucial. Teamwork is also important. We enjoyed working together with our friends sir."
      },
      {
        "name": "Prasidhika",
        "department": "ECE",
        "year": "3rd year",
        "comments": "It was a valuable experience sir. We learned about speed calculation, time management, and teamwork. Questions were easy except for a few. Particularly, teamwork helped a lot, sir."
      },
      {
        "name": "Vasuda",
        "department": "CSE",
        "year": "3rd year",
        "comments": "Compared to last year, this year, it felt like we were more ready to participate in Aptithon sir. The training that you guys provided us was really helpful for us to attend the questions with their concepts along with their method of approach! We still have to work on the time management part, sir! It helped us to know how much more we have to prepare and on what aspects we lag, sir. It was a good team experience for us to work together and solve the problems together, sir!"
      },
      {
        "name": "Madhumitha",
        "department": "ECE",
        "year": "3rd year",
        "comments": "It was like a self-analysis test. Most aptitude tests are taken in virtual mode, but working as a team in offline mode amidst a large number of co-contestants hints at a different level📈. The event was well organized. Kudos to the entire team for making this event a wonderful everlasting experience."
      },
      {
        "name": "Sachin",
        "department": "CSE",
        "year": "3rd year",
        "comments": "The training you provided was extremely helpful in understanding concepts and their approach to solving questions. We managed our time well and were able to solve most of the problems. This experience also helped us identify areas for further improvement. We truly appreciate the guidance and support. Thanks to the Training Dept."
      },
      {
        "name": "Lakshana.S",
        "department": "EEE",
        "year": "3rd year",
        "comments": "We had a great time sir. This is truly a great experience and hopefully, this has taken us a step ahead in our preparation. I was able to analyze in which particular area I was lagging and also to manage time."
      },
      {
        "name": "Sanjay S",
        "department": "EEE",
        "year": "3rd year",
        "comments": "I would like to express my gratitude to the college for organizing the Aptithon, which provided a valuable platform to enhance our aptitude skills. Participating in the event was a great learning experience. However, due to mismanagement of time, we couldn't qualify for the second round. This experience made me realize the crucial importance of time management while solving aptitude questions."
      },
      {
        "name": "SURRYA PRAKASH T",
        "department": "EEE",
        "year": "3rd year",
        "comments": "Compared to last year, this year felt more organized in hall allocation and a great improvement in question paper setting, which enables us to discuss and crack solutions in a faster manner. So, it has been a great team experience. We took this competition as a game and had more feedback among us where we want to improve for the best. Overall, it's a great initiative from the Training Department, who put lots of effort into organizing this Aptithon at its best. May it keep getting better in upcoming years!"
      },
      {
        "name": "Lohith N.R",
        "department": "EEE",
        "year": "2nd year",
        "comments": "I would like to extend my sincere gratitude for organizing the recent Aptithon competition. It was an incredible opportunity to participate in such a well-structured and engaging event, and I truly appreciate the effort and thoughtfulness that went into making it a success. The competition was not only challenging but also immensely rewarding. It provided a platform to test our skills, think critically, and push our boundaries in a supportive environment. The experience was both enlightening and motivating, and it has undoubtedly helped me gain a better understanding of my strengths and areas for improvement. Once again, thank you for this wonderful opportunity. I am truly grateful for the chance to be part of such a meaningful initiative, and I look forward to more such enriching experiences in the future."
      },
      {
        "name": "Lokesh.R",
        "department": "EEE",
        "year": "3rd year",
        "comments": "It was a good experience to take part in Aptithon. It is an excellent way to boost our reasoning, analytical, and time management skills. Keep engaging in such events to develop and refine our skills, sir!"
      },
      {
        "name": "Mohammed Shuhail M",
        "department": "EEE",
        "year": "3rd year",
        "comments": "It was an extremely incredible experience to participate in Aptithon-2025. The event was well-structured, offering a platform to showcase aptitude and problem-solving skills. The variety of challenges, from logical reasoning to quantitative aptitude, kept participants engaged and motivated. The competitive yet collaborative environment fostered learning and teamwork. Overall, Aptithon 2025 was a testament to the college's commitment to nurturing talent and promoting intellectual growth."
      },
      {
        "name": "SIVABALAKUMAR G",
        "department": "MBA",
        "year": "1st year",
        "comments": "It was a very interesting and wonderful opportunity for us to participate in the competition. This will help our future to develop problem-solving skills, time management, etc. So, thank you for this opportunity."
      },
      {
        "name": "KANISHKA D",
        "department": "FT",
        "year": "3rd year",
        "comments": "Aptithon helped me assess my problem-solving skills, and the time management aspect added a real-world challenge, enabling me to make quick decisions."
      },
      {
        "name": "Sanjith Bala P",
        "department": "CSE",
        "year": "3rd year",
        "comments": "We gained confidence in solving quant problems within the given time. It was a wonderful opportunity for us to collaborate as a team and work together. The training you provided was key to our success today. Hope to see more such opportunities in the future!"
      },
      {
        "name": "DINAGESHWARAN P",
        "department": "BME",
        "year": "3rd year",
        "comments": "It was very interesting and sped up our aptitude skills in the challenging competition. I would like to say my thanks to the Training Department staff and organizers who helped us in the event. Questions tested us, and we tested our skills. Thank you for conducting this type of question."
      },
      {
        "name": "V.E. Suryaprabhan",
        "department": "ECE",
        "year": "2nd year",
        "comments": "Aptithon was an exhilarating experience! 🎉 I faced many brainstorming questions, but the sense of accomplishment to the next round was incredible 🏆💪. Thank you to all the faculty members and organizers for making this wonderful event. Hope it will help me for my better future!"
      },
      {
        "name": "Midhunesh Raghu S K",
        "department": "EEE",
        "year": "3rd year",
        "comments": "Sir, this year, me and my friends improved a lot in time management and solving abilities compared to last year. The event was well organized. Thank you for conducting this contest. Thanks to the Placement Department."
      },
      {
        "name": "Manoranjitham K G",
        "department": "ECE",
        "year": "3rd year",
        "comments": "Sir, compared to last year, I felt improvement while solving quants... I'm able to solve quants in a little faster way. With teamwork, we enjoyed solving and also got ideas on some questions. The trial and error method helped me a lot, sir..."
      }
    ]
  }